#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-tfdemo-australiaeast]
azurerm_log_analytics_workspace.la: Refreshing state... [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-tfdemo-australiaeast/providers/Microsoft.OperationalInsights/workspaces/log-tfdemo-australiaeast]
azurerm_mssql_server.mssql: Refreshing state... [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-tfdemo-australiaeast/providers/Microsoft.Sql/servers/sql-tfdemo-australiaeast]
azurerm_service_plan.plan: Refreshing state... [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-tfdemo-australiaeast/providers/Microsoft.Web/serverfarms/plan-tfdemo-australiaeast]
azurerm_application_insights.appinsights: Refreshing state... [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-tfdemo-australiaeast/providers/Microsoft.Insights/components/appi-tfdemo-australiaeast]
azurerm_mssql_firewall_rule.azure_services: Refreshing state... [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-tfdemo-australiaeast/providers/Microsoft.Sql/servers/sql-tfdemo-australiaeast/firewallRules/AllowAllWindowsAzureIps]
azurerm_mssql_database.database: Refreshing state... [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-tfdemo-australiaeast/providers/Microsoft.Sql/servers/sql-tfdemo-australiaeast/databases/sqldb-tfdemo-australiaeast]
azurerm_linux_web_app.app: Refreshing state... [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-tfdemo-australiaeast/providers/Microsoft.Web/sites/app-tfdemo-australiaeast]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_linux_web_app.app will be updated in-place
  ~ resource "azurerm_linux_web_app" "app" {
        id                                = "/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-tfdemo-australiaeast/providers/Microsoft.Web/sites/app-tfdemo-australiaeast"
        name                              = "app-tfdemo-australiaeast"
        tags                              = {}
        # (19 unchanged attributes hidden)

      - connection_string {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + connection_string {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_mssql_database.database must be replaced
-/+ resource "azurerm_mssql_database" "database" {
      ~ auto_pause_delay_in_minutes         = 0 -> (known after apply)
      + creation_source_database_id         = (known after apply)
      ~ id                                  = "/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-tfdemo-australiaeast/providers/Microsoft.Sql/servers/sql-tfdemo-australiaeast/databases/sqldb-tfdemo-australiaeast" -> (known after apply)
      ~ ledger_enabled                      = false -> (known after apply)
      ~ min_capacity                        = 0 -> (known after apply)
        name                                = "sqldb-tfdemo-australiaeast"
      ~ read_replica_count                  = 0 -> (known after apply)
      ~ read_scale                          = false -> (known after apply)
      + restore_point_in_time               = (known after apply)
      + sample_name                         = (known after apply)
      ~ server_id                           = "/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-tfdemo-australiaeast/providers/Microsoft.Sql/servers/sql-tfdemo-australiaeast" -> (known after apply) # forces replacement
      - tags                                = {} -> null
        # (10 unchanged attributes hidden)

      ~ long_term_retention_policy (known after apply)
      - long_term_retention_policy {
          - monthly_retention = "PT0S" -> null
          - week_of_year      = 0 -> null
          - weekly_retention  = "PT0S" -> null
          - yearly_retention  = "PT0S" -> null
        }

      ~ short_term_retention_policy (known after apply)
      - short_term_retention_policy {
          - backup_interval_in_hours = 24 -> null
          - retention_days           = 7 -> null
        }

      ~ threat_detection_policy (known after apply)
      - threat_detection_policy {
          - disabled_alerts            = [] -> null
          - email_account_admins       = "Disabled" -> null
          - email_addresses            = [] -> null
          - retention_days             = 0 -> null
          - state                      = "Disabled" -> null
            # (2 unchanged attributes hidden)
        }
    }

  # azurerm_mssql_firewall_rule.azure_services must be replaced
-/+ resource "azurerm_mssql_firewall_rule" "azure_services" {
      ~ id               = "/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-tfdemo-australiaeast/providers/Microsoft.Sql/servers/sql-tfdemo-australiaeast/firewallRules/AllowAllWindowsAzureIps" -> (known after apply)
        name             = "AllowAllWindowsAzureIps"
      ~ server_id        = "/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-tfdemo-australiaeast/providers/Microsoft.Sql/servers/sql-tfdemo-australiaeast" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # azurerm_mssql_server.mssql must be replaced
-/+ resource "azurerm_mssql_server" "mssql" {
      ~ administrator_login                  = "superadmin" -> "sqladmin" # forces replacement
      ~ administrator_login_password         = (sensitive value)
      ~ fully_qualified_domain_name          = "sql-tfdemo-australiaeast.database.windows.net" -> (known after apply)
      ~ id                                   = "/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-tfdemo-australiaeast/providers/Microsoft.Sql/servers/sql-tfdemo-australiaeast" -> (known after apply)
        name                                 = "sql-tfdemo-australiaeast"
      + primary_user_assigned_identity_id    = (known after apply)
      ~ restorable_dropped_database_ids      = [] -> (known after apply)
      - tags                                 = {} -> null
        # (7 unchanged attributes hidden)

      ~ azuread_administrator {
          ~ azuread_authentication_only = false -> (known after apply)
          ~ tenant_id                   = "59b0934d-4f35-4bff-a2b7-a451fe5f8bd6" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "3a8b8e5b-bbb5-4889-8cdc-9dca5bd6e149" -> (known after apply)
          ~ tenant_id    = "59b0934d-4f35-4bff-a2b7-a451fe5f8bd6" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

Plan: 3 to add, 1 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @dependabot[bot], Action: `pull_request`*